USE HoshikoDB;
GO

TRUNCATE TABLE TvPrograms;
GO

INSERT INTO TvPrograms (StartTime, Title, ChannelName)
VALUES 
('2026-05-19 05:00:00', N'Телеканал "Доброе утро"', N'Первый канал'),
('2026-05-19 09:00:00', N'Новости (с субтитрами)', N'Первый канал'),
('2026-05-19 09:20:00', N'АнтиФейк', N'Первый канал'),
('2026-05-19 10:00:00', N'Жить здорово!', N'Первый канал'),
('2026-05-19 12:00:00', N'Новости (с полуденным выпуском)', N'Первый канал'),

('2026-05-19 07:00:00', N'Утреннее шоу "УТРО. ТНТ"', N'ТНТ'),
('2026-05-19 09:00:00', N'Экстрасенсы. Битва сильнейших', N'ТНТ'),
('2026-05-19 11:30:00', N'Сериал "Универ. 13 лет спустя"', N'ТНТ'),
('2026-05-19 13:00:00', N'Однажды в России', N'ТНТ'),

('2026-05-19 06:30:00', N'Утро. Самое лучшее', N'НТВ'),
('2026-05-19 08:00:00', N'Сегодня (Утренний выпуск)', N'НТВ'),
('2026-05-19 08:25:00', N'Поедем, поедим!', N'НТВ'),
('2026-05-19 10:00:00', N'Сегодня (Дневной выпуск)', N'НТВ'),
('2026-05-19 10:30:00', N'Сериал "Невский. Охота на Архитектора"', N'НТВ');
GO
